{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"outputs": {"labels_softmax": {"name": "labels_softmax"}}}}, "modelTopology": {"node": [{"name": "Reshape_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"unknownRank": true}}}}, {"name": "first_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "8"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "first_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "second_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "second_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "final_fc_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "62720"}, {"size": "8"}]}}}}}, {"name": "final_fc_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Conv2D", "op": "Conv2D", "input": ["Reshape_1", "first_weights"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "add", "op": "AddV2", "input": ["Conv2D", "first_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["add"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu", "op": "Relu", "input": ["MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Conv2D_1", "op": "Conv2D", "input": ["Relu", "second_weights"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "add_1", "op": "AddV2", "input": ["Conv2D_1", "second_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_1", "op": "Relu", "input": ["add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Reshape_2", "op": "Reshape", "input": ["Relu_1", "Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "MatMul", "op": "MatMul", "input": ["Reshape_2", "final_fc_weights"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "add_2", "op": "AddV2", "input": ["MatMul", "final_fc_bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "labels_softmax", "op": "Softmax", "input": ["add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "first_weights", "shape": [20, 8, 1, 64], "dtype": "float32"}, {"name": "first_bias", "shape": [64], "dtype": "float32"}, {"name": "second_weights", "shape": [10, 4, 64, 64], "dtype": "float32"}, {"name": "second_bias", "shape": [64], "dtype": "float32"}, {"name": "Reshape_2/shape", "shape": [2], "dtype": "int32"}, {"name": "final_fc_weights", "shape": [62720, 8], "dtype": "float32"}, {"name": "final_fc_bias", "shape": [8], "dtype": "float32"}]}]}